admin/yii/backend/controllers/LoginController.php

SELECT COUNT(*) FROM `user` WHERE u_owner='1'
SELECT * FROM `user` WHERE u_owner='1' ORDER BY `u_time` DESC LIMIT 5
---
	public function actionTable()
    {
		$query = User::find();

        $pagination = new Pagination([
            'defaultPageSize' => 5,
            'totalCount' => $query->where("u_owner='1'")->count(),
        ]);

        $countries = $query->where("u_owner='1'")->orderBy('u_time desc')
            ->offset($pagination->offset)
            ->limit($pagination->limit)
            ->all();