admin/yii/backend/controllers/LoginController.php

	public function actionTable()
    {
		$query = User::find();

        $pagination = new Pagination([
            'defaultPageSize' => 5,
            'totalCount' => $query->where("u_owner='1'")->count(),
        ]);

        $countries = $query->where("u_owner='1'")->orderBy('u_time desc')
            ->offset($pagination->offset)
            ->limit($pagination->limit)
            ->all();
---
SELECT COUNT(*) FROM `user` WHERE u_owner='1'
SELECT COUNT(*) FROM `user` WHERE u_owner='1' and u_name like '%%'
SELECT * FROM `user` WHERE u_owner='1' ORDER BY `u_time` DESC LIMIT 5

	public function actionFormowner(){
		$query = User::find();

        $pagination = new Pagination([
            'defaultPageSize' => 5,
            'totalCount' => $query->where("u_owner='2'")->count(),
        ]);

        $countries = $query->where("u_owner='2'")->orderBy('u_time desc')
            ->offset($pagination->offset)
            ->limit($pagination->limit)
            ->all();
---
SELECT COUNT(*) FROM `user` WHERE u_owner='2'
SELECT * FROM `user` WHERE u_name like '%%' ORDER BY `u_time` DESC LIMIT 5
SELECT COUNT(*) FROM `user` WHERE u_owner='2' and u_name like '%%'

	public function actionAdd_house(){
		$session=Yii::$app->session;
		$name=$session->get('name');
		$query = House::find();

        $pagination = new Pagination([
            'defaultPageSize' => 5,
            'totalCount' => $query->where("h_state='0'")->count(),
        ]);

        $countries = $query->where("h_state='0'")
            ->offset($pagination->offset)
            ->limit($pagination->limit)
            ->all();
---
SELECT COUNT(*) FROM `house` WHERE h_state='0'
SELECT * FROM `house` WHERE h_state='0' LIMIT 5