admin/yii/backend/controllers/MessageController.php

	public function actionCheck_ing(){
		$request=Yii::$app->request;
		$id=$request->get('id');
		$state=$request->get('state');

		$re=Yii::$app->db->createCommand()->update('report',['r_state'=>$state],"r_id=:id",[':id'=> $id])->execute();
---
UPDATE `report` SET `r_state`='3' WHERE r_id='1'