admin/yii/backend/controllers/MessageController.php

	public function actionList(){
		$session=Yii::$app->session;
		$name=$session->get('name');

		//接受搜索的值
		$request=Yii::$app->request;
		$search=$request->get('search')?$request->get('search'):'';

		$query = Report::find();

        $pagination = new Pagination([
            'defaultPageSize' => 5,
            'totalCount' => $query->where("r_state=2 or r_state=3 and r_h_id like '%$search%'")->count(),
        ]);

        $countries = $query->where("r_state=2 or r_state=3 and r_h_id like '%$search%'")
            ->offset($pagination->offset)
            ->limit($pagination->limit)
            ->all();
---
SELECT COUNT(*) FROM `report` WHERE r_state=2 or r_state=3 and r_h_id like '%%'
SELECT COUNT(*) FROM `report` WHERE r_state=0
SELECT * FROM `report` WHERE r_state=2 or r_state=3 and r_h_id like '%%' LIMIT 5